### Imports ###

In [1]:
import pandas as pd

### Read data and get some statistics ###

In [5]:
df_phone = pd.read_csv('dataset_mood_smartphone.csv', usecols=['id', 'time', 'variable', 'value'])
df_phone['time'] = pd.to_datetime(df_phone['time'])
print(df_phone.dtypes)

id                  object
time        datetime64[ns]
variable            object
value              float64
dtype: object

In [6]:
df_phone.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376912 entries, 0 to 376911
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   id        376912 non-null  object
 1   time      376912 non-null  datetime64[ns]
 2   variable  376912 non-null  object
 3   value     376710 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 11.5+ MB

In [3]:
df_phone.describe(datetime_is_numeric=True, include='all')

             id                           time variable          value
count    376912                         376912   376912  376710.000000
unique       27                            NaN       19            NaN
top     AS14.01                            NaN   screen            NaN
freq      21999                            NaN    96578            NaN
mean        NaN  2014-04-16 05:01:16.959544064      NaN      40.665313
min         NaN     2014-02-17 07:00:52.197000      NaN  -82798.871000
25%         NaN            2014-04-03 15:00:00      NaN       2.025000
50%         NaN  2014-04-15 22:13:12.874500096      NaN       7.029000
75%         NaN  2014-04-27 19:25:38.207000064      NaN      29.356000
max         NaN            2014-06-09 00:00:00      NaN   33960.246000
std         NaN                            NaN      NaN     273.726007